12emilia21/Fault-Location-Implementation/buck_converter_dma_original/c2000.syscfg
/**
 * These arguments were used when this file was generated. They will be automatically applied on subsequent loads
 * via the GUI or CLI. Run CLI with '--help' for additional information on how to override these arguments.
 * @cliArgs --device "F28004x" --package "F28004x_100PZ" --part "F28004x_100PZ" --context "system" --product "C2000WARE@4.03.00.00"
 * @versions {"tool":"1.15.0+2826"}
 */

/**
 * Import the modules used in this configuration.
 */
const adc              = scripting.addModule("/driverlib/adc.js", {}, false);
const adc1             = adc.addInstance();
const adc2             = adc.addInstance();
const adc3             = adc.addInstance();
const asysctl          = scripting.addModule("/driverlib/asysctl.js");
const cla              = scripting.addModule("/driverlib/cla.js", {}, false);
const cla1             = cla.addInstance();
const cputimer         = scripting.addModule("/driverlib/cputimer.js", {}, false);
const cputimer1        = cputimer.addInstance();
const dma              = scripting.addModule("/driverlib/dma.js", {}, false);
const dma1             = dma.addInstance();
const dma2             = dma.addInstance();
const dma3             = dma.addInstance();
const dma4             = dma.addInstance();
const dma5             = dma.addInstance();
const epwm             = scripting.addModule("/driverlib/epwm.js");
const epwm1            = epwm.addInstance();
const epwm2            = epwm.addInstance();
const gpio             = scripting.addModule("/driverlib/gpio.js", {}, false);
const gpio1            = gpio.addInstance();
const gpio2            = gpio.addInstance();
const gpio3            = gpio.addInstance();
const gpio4            = gpio.addInstance();
const inputxbar_input  = scripting.addModule("/driverlib/inputxbar_input.js", {}, false);
const inputxbar_input1 = inputxbar_input.addInstance();
const inputxbar_input2 = inputxbar_input.addInstance();
const inputxbar_input3 = inputxbar_input.addInstance();
const memcfg           = scripting.addModule("/driverlib/memcfg.js");
const FPUfastRTS       = scripting.addModule("/libraries/math/FPUfastRTS/FPUfastRTS.js", {}, false);
const FPUfastRTS1      = FPUfastRTS.addInstance();

/**
 * Write custom configuration values to the imported modules.
 */
adc1.$name                          = "myADC0";
adc1.soc0UseCalculatedSampleTime    = true;
adc1.soc0UseSampleTimeCalculator    = true;
adc1.soc1UseSampleTimeCalculator    = true;
adc1.soc1UseCalculatedSampleTime    = true;
adc1.soc2Trigger                    = "ADC_TRIGGER_EPWM1_SOCA";
adc1.soc3Trigger                    = "ADC_TRIGGER_EPWM1_SOCA";
adc1.soc6Trigger                    = "ADC_TRIGGER_EPWM1_SOCB";
adc1.soc5Trigger                    = "ADC_TRIGGER_EPWM1_SOCB";
adc1.soc7Trigger                    = "ADC_TRIGGER_EPWM1_SOCB";
adc1.soc8Trigger                    = "ADC_TRIGGER_EPWM1_SOCB";
adc1.soc9Trigger                    = "ADC_TRIGGER_EPWM1_SOCB";
adc1.enabledSOCs                    = ["ADC_SOC_NUMBER0","ADC_SOC_NUMBER1"];
adc1.soc0Name                       = "Iin1";
adc1.soc1Name                       = "Iin2";
adc1.interruptCycleOffset           = 10;
adc1.interruptPulseMode             = "ADC_PULSE_END_OF_CONV";
adc1.interrupt2SOCSource            = "ADC_SOC_NUMBER1";
adc1.soc0Trigger                    = "ADC_TRIGGER_EPWM2_SOCA";
adc1.soc1Trigger                    = "ADC_TRIGGER_EPWM2_SOCA";
adc1.enableInterrupt1               = true;
adc1.enableInterrupt1ContinuousMode = true;
adc1.interrupt1SOCSource            = "ADC_SOC_NUMBER1";
adc1.enabledInts                    = ["ADC_INT_NUMBER1"];

adc2.$name                          = "myADC1";
adc2.adcBase                        = "ADCC_BASE";
adc2.soc0UseSampleTimeCalculator    = true;
adc2.soc0UseCalculatedSampleTime    = true;
adc2.soc1UseSampleTimeCalculator    = true;
adc2.soc1UseCalculatedSampleTime    = true;
adc2.soc2Channel                    = "ADC_CH_ADCIN5";
adc2.soc2UseSampleTimeCalculator    = true;
adc2.soc2UseCalculatedSampleTime    = true;
adc2.soc3Channel                    = "ADC_CH_ADCIN5";
adc2.soc3UseSampleTimeCalculator    = true;
adc2.soc3UseCalculatedSampleTime    = true;
adc2.soc2Name                       = "Vin1";
adc2.soc3Name                       = "Vin2";
adc2.enabledSOCs                    = ["ADC_SOC_NUMBER0","ADC_SOC_NUMBER1","ADC_SOC_NUMBER2","ADC_SOC_NUMBER3","ADC_SOC_NUMBER4","ADC_SOC_NUMBER5"];
adc2.soc4Name                       = "Il1";
adc2.soc4UseSampleTimeCalculator    = true;
adc2.soc4UseCalculatedSampleTime    = true;
adc2.soc5Name                       = "Il2";
adc2.soc5UseSampleTimeCalculator    = true;
adc2.soc5UseCalculatedSampleTime    = true;
adc2.interruptPulseMode             = "ADC_PULSE_END_OF_CONV";
adc2.enableInterrupt1               = true;
adc2.soc0Name                       = "Vo1";
adc2.soc1Name                       = "Vo2";
adc2.enableInterrupt3               = true;
adc2.enableInterrupt1ContinuousMode = true;
adc2.socHighPriorityMode            = "ADC_PRI_THRU_SOC5_HIPRI";
adc2.soc0Channel                    = "ADC_CH_ADCIN14";
adc2.soc1Channel                    = "ADC_CH_ADCIN14";
adc2.soc4Channel                    = "ADC_CH_ADCIN3";
adc2.soc5Channel                    = "ADC_CH_ADCIN3";
adc2.soc0Trigger                    = "ADC_TRIGGER_EPWM2_SOCA";
adc2.soc1Trigger                    = "ADC_TRIGGER_EPWM2_SOCA";
adc2.soc2Trigger                    = "ADC_TRIGGER_EPWM2_SOCA";
adc2.soc3Trigger                    = "ADC_TRIGGER_EPWM2_SOCA";
adc2.soc4Trigger                    = "ADC_TRIGGER_EPWM2_SOCA";
adc2.soc5Trigger                    = "ADC_TRIGGER_EPWM2_SOCA";
adc2.interrupt1SOCSource            = "ADC_SOC_NUMBER5";
adc2.enabledInts                    = ["ADC_INT_NUMBER1","ADC_INT_NUMBER2"];
adc2.enableInterrupt2               = true;
adc2.enableInterrupt2ContinuousMode = true;
adc2.interrupt2SOCSource            = "ADC_SOC_NUMBER1";

adc3.$name                          = "myADC2";
adc3.adcBase                        = "ADCB_BASE";
adc3.enabledSOCs                    = ["ADC_SOC_NUMBER0","ADC_SOC_NUMBER1"];
adc3.soc0UseSampleTimeCalculator    = true;
adc3.soc0UseCalculatedSampleTime    = true;
adc3.soc1Channel                    = "ADC_CH_ADCIN6";
adc3.soc1UseSampleTimeCalculator    = true;
adc3.soc1UseCalculatedSampleTime    = true;
adc3.soc0Name                       = "Io1";
adc3.soc1Name                       = "Io2";
adc3.interruptPulseMode             = "ADC_PULSE_END_OF_CONV";
adc3.enableInterrupt1               = true;
adc3.enableInterrupt1ContinuousMode = true;
adc3.interrupt2SOCSource            = "ADC_SOC_NUMBER1";
adc3.soc0Channel                    = "ADC_CH_ADCIN6";
adc3.soc0Trigger                    = "ADC_TRIGGER_EPWM2_SOCA";
adc3.soc1Trigger                    = "ADC_TRIGGER_EPWM2_SOCA";
adc3.interrupt1SOCSource            = "ADC_SOC_NUMBER1";
adc3.enabledInts                    = ["ADC_INT_NUMBER1","ADC_INT_NUMBER2"];
adc3.enableInterrupt2ContinuousMode = true;
adc3.enableInterrupt2               = true;

asysctl.analogReference        = "INTERNAL";
asysctl.analogReferenceVoltage = "1P65";

