12emilia21/Fault-Location-Implementation/buck_converter_dma_original/c2000.syscfg
gpio2.direction                 = "GPIO_DIR_MODE_OUT";
gpio2.useInterrupt              = true;
gpio2.$name                     = "transient_det_pin";
gpio2.writeInitialValue         = true;
gpio2.gpioPin.$assign           = "ball.51";
gpio2.xint.intType              = "GPIO_INT_TYPE_RISING_EDGE";
gpio2.xint.enableInt            = true;
gpio2.xint.registerInterrupts   = true;
gpio2.xint.xInt.enableInterrupt = true;

gpio3.direction                 = "GPIO_DIR_MODE_OUT";
gpio3.useInterrupt              = true;
gpio3.$name                     = "trigger_ls";
gpio3.writeInitialValue         = true;
gpio3.gpioPin.$assign           = "ball.54";
gpio3.xint.xintNum              = "GPIO_INT_XINT2";
gpio3.xint.enableInt            = true;
gpio3.xint.registerInterrupts   = true;
gpio3.xint.intType              = "GPIO_INT_TYPE_RISING_EDGE";
gpio3.xint.xInt.enableInterrupt = true;

gpio4.$name             = "CLA_test";
gpio4.direction         = "GPIO_DIR_MODE_OUT";
gpio4.controllerCore    = "GPIO_CORE_CPU1_CLA1";
gpio4.writeInitialValue = true;
gpio4.gpioPin.$assign   = "ball.55";

inputxbar_input1.$name         = "myINPUTXBARINPUT0";
gpio2.xint.inputxbar           = inputxbar_input1;
inputxbar_input1.inputxbarGpio = "GPIO12";

inputxbar_input2.$name         = "myINPUTXBARINPUT1";
gpio3.xint.inputxbar           = inputxbar_input2;
inputxbar_input2.inputxbarGpio = "GPIO16";

inputxbar_input3.$name          = "myINPUTXBARINPUT2";
inputxbar_input3.inputxbarInput = "XBAR_INPUT13";
inputxbar_input3.inputxbarGpio  = "GPIO17";

memcfg.config_MEMCFG_SECT_LS0 = "CLA_prog";
memcfg.config_MEMCFG_SECT_LS3 = "CLA_data";
memcfg.config_MEMCFG_SECT_LS2 = "CLA_data";

FPUfastRTS1.$name = "myFFR0";
